/*
জাভাস্ক্রিপ্ট ইভেন্ট লুপ (JavaScript Event Loop) হল জাভাস্ক্রিপ্টের একটি বিশেষ ফিচার যা জাভাস্ক্রিপ্ট কোড রান করার সময় ব্যবহৃত হয়। এটি একটি লুপ হিসেবে কাজ করে এবং জাভাস্ক্রিপ্ট এপ্লিকেশনের কোডে যেকোনো ইভেন্ট ঘটে তখন কলব্যাক ফাংশনগুলি সঠিক সিকুরিটি মেনে অর্ডার ভিত্তিতে রান হওয়া নিশ্চিত করে।

যখন একটি ইভেন্ট (event) ঘটে যেমন কোনো বাটনে ক্লিক করা, কোনো ফরমে ইনপুট করা এবং সাবমিট করা ইত্যাদি, তখন জাভাস্ক্রিপ্ট ইভেন্ট লুপ আরম্ভ হয়। এটি ইভেন্ট কিউ (event queue) থেকে ইভেন্টগুলি নিতে থাকে এবং তাদের সঠিক অর্ডার মেনে কলব্যাক ফাংশনগুলি রান করার জন্য রেডি রাখে। এটি একটি সিঙ্গল থ্রেডে কাজ করে এবং কোডে নির্দিষ্ট সময়কালে কাজ করতে থাকে যাতে জাভাস্ক্রিপ্ট এপ্লিকেশনের কোড সঠিকভাবে রান করতে পারে।
*/